app/Controllers/Atraksi.php

SELECT *
FROM `user`
WHERE `user`.`id` = '87a6af6c-35a1-4aa4-b74c-cc6f106e3aeb'
SELECT `atraksi`.*, `city`.`name` as `city_name`
FROM `atraksi`
LEFT JOIN `city` ON `city`.`id` = `atraksi`.`city_id`
WHERE `atraksi`.`id` != 'a2'
 LIMIT 5
---
    public function detail($slug)
    {
        $model = new \App\Models\AtraksiModel();
        $atraksi = $model->getAtraksiWithDetails($slug);

        if (!$atraksi) {
            throw \CodeIgniter\Exceptions\PageNotFoundException::forPageNotFound();
        }

        $user = null;
        if (session()->get('isLoggedIn')) {
            $userModel = new \App\Models\UserModel();
            $user = $userModel->find(session()->get('userId'));
        }

        $db = \Config\Database::connect();
        $relatedAtraksi = $db->table('atraksi')
            ->select('atraksi.*, city.name as city_name')
            ->join('city', 'city.id = atraksi.city_id', 'left')
            ->where('atraksi.id !=', $atraksi['id'])
            ->limit(5)
            ->get()->getResultArray();

SELECT *
FROM `order`
WHERE `id` = '1afce900-48d7-41a5-963b-ee9558d08094'
AND `user_id` = '87a6af6c-35a1-4aa4-b74c-cc6f106e3aeb'
SELECT *
FROM `order_item`
WHERE `order_id` = '1afce900-48d7-41a5-963b-ee9558d08094'
SELECT *
FROM `atraksi`
WHERE `id` = 'a2'
---
    public function waitingPayment($orderId)
    {
        if (!session()->get('isLoggedIn')) {
            return redirect()->to('/login');
        }

        $db = \Config\Database::connect();
        $order = $db->table('order')->where('id', $orderId)->where('user_id', session()->get('userId'))->get()->getRowArray();

        if (!$order) {
            throw \CodeIgniter\Exceptions\PageNotFoundException::forPageNotFound();
        }

        $orderItem = $db->table('order_item')->where('order_id', $orderId)->get()->getRowArray();
        $atraksi = $db->table('atraksi')->where('id', $orderItem['ticket_id'])->get()->getRowArray();