app/Controllers/Auth.php

SELECT *
FROM `user`
WHERE `email` = 'arir6772@gmail.com'
 LIMIT 1
---
    public function login()
    {
        if ($this->request->getMethod() === 'POST' || $this->request->getMethod() === 'post') {
            $email = $this->request->getPost('email');
            $password = $this->request->getPost('password');

            $model = new UserModel();
            $user = $model->where('email', $email)->first();