app/Controllers/Cart.php

    public function index()
    {
        if (!session()->get('isLoggedIn')) {
            return redirect()->to('/login')->with('error', 'Silakan login terlebih dahulu untuk melihat keranjang.');
        }

        $userId = session()->get('userId');
        $db = \Config\Database::connect();

        $cartItems = $db->table('cart')
            ->select('cart.id as cart_id, cart.quantity, atraksi.title, atraksi.price, atraksi.banner_image, atraksi.slug')
            ->join('atraksi', 'atraksi.id = cart.ticket_id')
            ->where('cart.user_id', $userId)
            ->get()->getResultArray();
---
SELECT `cart`.`id` as `cart_id`, `cart`.`quantity`, `atraksi`.`title`, `atraksi`.`price`, `atraksi`.`banner_image`, `atraksi`.`slug`
FROM `cart`
JOIN `atraksi` ON `atraksi`.`id` = `cart`.`ticket_id`
WHERE `cart`.`user_id` = '87a6af6c-35a1-4aa4-b74c-cc6f106e3aeb'

    public function add()
    {
        if (!session()->get('isLoggedIn')) {
            return $this->response->setJSON(['status' => 'error', 'message' => 'Silakan login terlebih dahulu']);
        }

        $userId = session()->get('userId');
        $ticketId = $this->request->getPost('ticket_id');
        $quantity = (int) $this->request->getPost('quantity') ?? 1;

        $db = \Config\Database::connect();

        // Check if item already in cart
        $existing = $db->table('cart')
            ->where('user_id', $userId)
            ->where('ticket_id', $ticketId)
            ->get()->getRowArray();

        if ($existing) {
            $db->table('cart')
                ->where('id', $existing['id'])
                ->update(['quantity' => $existing['quantity'] + $quantity]);
---
SELECT *
FROM `cart`
WHERE `user_id` = '87a6af6c-35a1-4aa4-b74c-cc6f106e3aeb'
AND `ticket_id` = 'a1'
UPDATE `cart` SET `quantity` = 2
WHERE `id` = 'c65f9c23-dcb0-42cd-8123-8a3c42be1c4b'

    public function getCart()
    {
        if (!session()->get('isLoggedIn')) {
            return $this->response->setJSON(['status' => 'success', 'items' => []]);
        }

        $userId = session()->get('userId');
        $db = \Config\Database::connect();

        // Assuming ticket_id references atraksi.id for Atraksi
        $items = $db->table('cart')
            ->select('cart.id as cart_id, cart.quantity, atraksi.title, atraksi.price, atraksi.banner_image')
            ->join('atraksi', 'atraksi.id = cart.ticket_id')
            ->where('cart.user_id', $userId)
            ->get()->getResultArray();
---
SELECT `cart`.`id` as `cart_id`, `cart`.`quantity`, `atraksi`.`title`, `atraksi`.`price`, `atraksi`.`banner_image`
FROM `cart`
JOIN `atraksi` ON `atraksi`.`id` = `cart`.`ticket_id`
WHERE `cart`.`user_id` = '87a6af6c-35a1-4aa4-b74c-cc6f106e3aeb'

    public function checkout()
    {
        if (!session()->get('isLoggedIn')) {
            return redirect()->to('/login');
        }

        $userId = session()->get('userId');
        $db = \Config\Database::connect();

        $cartItems = $db->table('cart')
            ->select('cart.id as cart_id, cart.quantity, atraksi.id as atraksi_id, atraksi.title, atraksi.price')
            ->join('atraksi', 'atraksi.id = cart.ticket_id')
            ->where('cart.user_id', $userId)
            ->get()->getResultArray();

        if (empty($cartItems)) {
            return redirect()->to('/cart')->with('error', 'Keranjang Anda kosong');
        }

        $userModel = new \App\Models\UserModel();
        $user = $userModel->find($userId);
---
SELECT `cart`.`id` as `cart_id`, `cart`.`quantity`, `atraksi`.`id` as `atraksi_id`, `atraksi`.`title`, `atraksi`.`price`
FROM `cart`
JOIN `atraksi` ON `atraksi`.`id` = `cart`.`ticket_id`
WHERE `cart`.`user_id` = '87a6af6c-35a1-4aa4-b74c-cc6f106e3aeb'
SELECT *
FROM `user`
WHERE `user`.`id` = '87a6af6c-35a1-4aa4-b74c-cc6f106e3aeb'