app/Controllers/Cart.php

    public function getCart()
    {
        if (!session()->get('isLoggedIn')) {
            return $this->response->setJSON(['status' => 'success', 'items' => []]);
        }

        $userId = session()->get('userId');
        $db = \Config\Database::connect();

        // Assuming ticket_id references atraksi.id for Atraksi
        $items = $db->table('cart')
            ->select('cart.id as cart_id, cart.quantity, atraksi.title, atraksi.price, atraksi.banner_image')
            ->join('atraksi', 'atraksi.id = cart.ticket_id')
            ->where('cart.user_id', $userId)
            ->get()->getResultArray();
---
SELECT `cart`.`id` as `cart_id`, `cart`.`quantity`, `atraksi`.`title`, `atraksi`.`price`, `atraksi`.`banner_image`
FROM `cart`
JOIN `atraksi` ON `atraksi`.`id` = `cart`.`ticket_id`
WHERE `cart`.`user_id` = '87a6af6c-35a1-4aa4-b74c-cc6f106e3aeb'