app/Controllers/Event.php

SELECT *
FROM `ticket`
WHERE `id` = 'tkt-teras-1'
AND `event_id` = 'evt-teras'
---

        foreach ($ticketsInput as $ticketId => $qty) {
            if ($qty > 0) {
                $ticket = $db->table('ticket')->where('id', $ticketId)->where('event_id', $event['id'])->get()->getRowArray();

SELECT *
FROM `user`
WHERE `user`.`id` = '9b179e1a-25cc-415a-92e6-619c32ea78f4'
---
        $userModel = new \App\Models\UserModel();
        $user = [];
        if (session()->get('isLoggedIn')) {
            $user = $userModel->find(session()->get('userId'));