app/Controllers/Home.php

    public function index()
    {
        $model = new UserModel();
        $data['semua_user'] = $model->findAll();
---
SELECT *
FROM `users`