app/Controllers/Profile.php

SELECT *
FROM `user`
WHERE `user`.`id` = '87a6af6c-35a1-4aa4-b74c-cc6f106e3aeb'
---
    public function index()
    {
        if (!session()->get('isLoggedIn')) {
            return redirect()->to('/login');
        }

        $userId = session()->get('userId');
        $model = new UserModel();
        $user = $model->find($userId);

UPDATE `user` SET `full_name` = 'Annisa Revalina Harahap', `no_handphone` = '+93+93+62082281995001', `tanggal_lahir` = '2026-05-08', `gender` = 'Perempuan', `negara` = 'Djibouti', `kota` = ''
WHERE `user`.`id` IN ('87a6af6c-35a1-4aa4-b74c-cc6f106e3aeb')
---
                'kota' => $kota
            ];

            $model->update($userId, $data);

SELECT `order`.`id` as `order_id`, `order`.`order_no`, `order`.`created_at`, `order`.`pay_status`, `order`.`grand_total`, `order_item`.`quantity`, `atraksi`.`title`, `atraksi`.`slug`
FROM `order`
JOIN `order_item` ON `order_item`.`order_id` = `order`.`id`
JOIN `atraksi` ON `atraksi`.`id` = `order_item`.`ticket_id`
WHERE `order`.`user_id` = '87a6af6c-35a1-4aa4-b74c-cc6f106e3aeb'
ORDER BY `order`.`created_at` DESC
---
        $namaBelakangDb = $names[1] ?? '';

        $db = \Config\Database::connect();
        $atraksiOrders = $db->table('order')
            ->select('order.id as order_id, order.order_no, order.created_at, order.pay_status, order.grand_total, order_item.quantity, atraksi.title, atraksi.slug')
            ->join('order_item', 'order_item.order_id = order.id')
            ->join('atraksi', 'atraksi.id = order_item.ticket_id')
            ->where('order.user_id', $userId)
            ->orderBy('order.created_at', 'DESC')
            ->get()->getResultArray();