app/Models/AtraksiModel.php

SELECT `atraksi`.*, `category`.`title` as `category_name`, `city`.`name` as `city_name`, `country`.`name` as `country_name`
FROM `atraksi`
LEFT JOIN `category` ON `category`.`id` = `atraksi`.`category_id`
LEFT JOIN `city` ON `city`.`id` = `atraksi`.`city_id`
LEFT JOIN `country` ON `country`.`id` = `atraksi`.`country_id`
SELECT `atraksi`.*, `category`.`title` as `category_name`, `city`.`name` as `city_name`, `country`.`name` as `country_name`
FROM `atraksi`
LEFT JOIN `category` ON `category`.`id` = `atraksi`.`category_id`
LEFT JOIN `city` ON `city`.`id` = `atraksi`.`city_id`
LEFT JOIN `country` ON `country`.`id` = `atraksi`.`country_id`
WHERE `atraksi`.`slug` = 'universal-orlando-resort'
---
    public function getAtraksiWithDetails($slug = null)
    {
        $builder = $this->db->table($this->table);
        $builder->select('atraksi.*, category.title as category_name, city.name as city_name, country.name as country_name');
        $builder->join('category', 'category.id = atraksi.category_id', 'left');
        $builder->join('city', 'city.id = atraksi.city_id', 'left');
        $builder->join('country', 'country.id = atraksi.country_id', 'left');

        if ($slug === null) {
            return $builder->get()->getResultArray();
        }

        return $builder->where('atraksi.slug', $slug)->get()->getRowArray();