app/Models/EventModel.php

SELECT `event`.`id`, `event`.`title`, `event`.`slug`, `event`.`banner_image`, MIN(schedule.started_at) as event_date, MIN(ticket.price) as start_price, `city`.`name` as `city_name`
FROM `event`
LEFT JOIN `schedule` ON `schedule`.`event_id` = `event`.`id`
LEFT JOIN `ticket` ON `ticket`.`event_id` = `event`.`id`
LEFT JOIN `venue` ON `venue`.`id` = `event`.`venue_id`
LEFT JOIN `city` ON `city`.`id` = `venue`.`city_id`
GROUP BY `event`.`id`
ORDER BY `event_date` ASC
---
    public function getEvents($search = null, $date = null, $sort = 'asc')
    {
        $builder = $this->db->table($this->table);
        $builder->select('event.id, event.title, event.slug, event.banner_image, MIN(schedule.started_at) as event_date, MIN(ticket.price) as start_price, city.name as city_name');

        $builder->join('schedule', 'schedule.event_id = event.id', 'left');
        $builder->join('ticket', 'ticket.event_id = event.id', 'left');
        $builder->join('venue', 'venue.id = event.venue_id', 'left');
        $builder->join('city', 'city.id = venue.city_id', 'left');

        if (!empty($search)) {
            $builder->like('event.title', $search);
        }

        if (!empty($date)) {
            $builder->where('DATE(schedule.started_at)', $date);
        }

        $builder->groupBy('event.id');

        $sortOrder = (strtolower($sort) === 'desc') ? 'DESC' : 'ASC';
        $builder->orderBy('event_date', $sortOrder);

        return $builder->get()->getResultArray();

SELECT `event`.*, `venue`.`title` as `venue_name`, `city`.`name` as `city_name`
FROM `event`
LEFT JOIN `venue` ON `venue`.`id` = `event`.`venue_id`
LEFT JOIN `city` ON `city`.`id` = `venue`.`city_id`
WHERE `event`.`slug` = 'regent-cup'
---
    public function getEventWithDetails($slug)
    {
        $builder = $this->db->table($this->table);
        $builder->select('event.*, venue.title as venue_name, city.name as city_name');
        $builder->join('venue', 'venue.id = event.venue_id', 'left');
        $builder->join('city', 'city.id = venue.city_id', 'left');
        return $builder->where('event.slug', $slug)->get()->getRowArray();

SELECT *
FROM `ticket`
WHERE `event_id` = 'evt-regent'
---
    public function getEventTickets($eventId)
    {
        return $this->db->table('ticket')
            ->where('event_id', $eventId)
            ->get()->getResultArray();

SELECT *
FROM `schedule`
WHERE `event_id` = 'evt-regent'
ORDER BY `started_at` ASC
---
    public function getEventSchedules($eventId)
    {
        return $this->db->table('schedule')
            ->where('event_id', $eventId)
            ->orderBy('started_at', 'ASC')
            ->get()->getResultArray();

SELECT `event`.`id`, `event`.`title`, `event`.`slug`, `event`.`banner_image`, MIN(schedule.started_at) as event_date, MIN(ticket.price) as start_price, `city`.`name` as `city_name`
FROM `event`
LEFT JOIN `schedule` ON `schedule`.`event_id` = `event`.`id`
LEFT JOIN `ticket` ON `ticket`.`event_id` = `event`.`id`
LEFT JOIN `venue` ON `venue`.`id` = `event`.`venue_id`
LEFT JOIN `city` ON `city`.`id` = `venue`.`city_id`
WHERE `event`.`id` != 'evt-regent'
GROUP BY `event`.`id`
ORDER BY `event_date` ASC
 LIMIT 4
---
    public function getRelatedEvents($excludeId = null)
    {
        $builder = $this->db->table($this->table);
        $builder->select('event.id, event.title, event.slug, event.banner_image, MIN(schedule.started_at) as event_date, MIN(ticket.price) as start_price, city.name as city_name');

        $builder->join('schedule', 'schedule.event_id = event.id', 'left');
        $builder->join('ticket', 'ticket.event_id = event.id', 'left');
        $builder->join('venue', 'venue.id = event.venue_id', 'left');
        $builder->join('city', 'city.id = venue.city_id', 'left');

        if ($excludeId) {
            $builder->where('event.id !=', $excludeId);
        }

        $builder->groupBy('event.id');
        $builder->orderBy('event_date', 'ASC');
        $builder->limit(4);

        return $builder->get()->getResultArray();